#include "aduc812.h"
#include "sio.h"
#include "driver.h"

size_t rfifo_len, wfifo_len;
unsigned char rfifo[FIFO_SIZE];
unsigned char wfifo[FIFO_SIZE];

void init_UART( void )
{
	SetVector((unsigned char __xdata *)0x2023, (void *)SIO_ISR);
	init_sio(S9600);
}

/**----------------------------------------------------------------------------
                            read_UART
-------------------------------------------------------------------------------
Описание:	запись в symbol элемента из wfifo
Где используется: внутри главного цикла программы
Что под капотом:	Запись в symbol[0] элемента rfifo[0], сдвиг rfifo вправо и
					декремент счетчика rfifo_len.
Вход:	указатель на символ, в который пишем из буфера
Выход:	1 - если элемент был считан из буфера в symbol
		0 - если в rfifo не было символов
-----------------------------------------------------------------------------*/
unsigned char read_UART( unsigned char * symbol )
{
	int i;

	if ( 0 < rfifo_len )
	{
		*symbol = rfifo[0];
		--rfifo_len;

		for (i = 0; i < rfifo_len; i++)
			rfifo[i] = rfifo[i + 1];

		return 1;
	}

	return 0;
}

/**----------------------------------------------------------------------------
                            write_UART
-------------------------------------------------------------------------------
Описание:	помещение в очередь wfifo очередного символа
Где используется: внутри главного цикла программы
Что под капотом:	Запись в wfifo[...] символа c, сдвиг wfifo вправо и
					инкремент счетчика wfifo_len.
Вход:	символ для передачи по UART
Выход:	нет
-----------------------------------------------------------------------------*/
void write_UART( unsigned char c )
{
	wfifo[wfifo_len % FIFO_SIZE] = c;

	if (wfifo_len < FIFO_SIZE)
		++wfifo_len;
}

/**----------------------------------------------------------------------------
                            rfifo_push
-------------------------------------------------------------------------------
Описание:	Передача входного символа в rfifo, сдвиг rfifo
Использование: при прерывании
Вход:		символ в rfifo
Выход:		нет
-----------------------------------------------------------------------------*/
void rfifo_push( unsigned char c )
{
	rfifo[rfifo_len % FIFO_SIZE] = c;

	if (rfifo_len < FIFO_SIZE)
		++rfifo_len;
}

/**----------------------------------------------------------------------------
                            wfifo_pop
-------------------------------------------------------------------------------
Описание:		Передача char-элемента/символа из начала wfifo в начало symbol
				массива.
Использование: при прерывании
Что под капотом:	Запись в symbol[0] элемента wfifo[0], сдвиг wfifo вправо и
					декремент счетчика wfifo_len.
Выход:		1 - если элемент был записан
			0 - если в wfifo не было символов
-----------------------------------------------------------------------------*/
unsigned char wfifo_pop( unsigned char * symbol )
{
	int i;

	if ( 0 < wfifo_len )
	{
		*symbol = wfifo[0];
		--wfifo_len;

		for (i = 0; i < wfifo_len; i++)
			wfifo[i] = wfifo[i + 1];

		return 1;
	}

	return 0;
}

void SIO_ISR( void ) __interrupt ( 4 )
{
	// Interrrupt blog for sending data
	if( TI )
	{
		wfifo_pop(SBUF);  // write symbol from wfifo to SBUF
		TI = 0;
	}

	// Interrrupt blog for receiving data
	if( RI )
	{
		rfifo_push(SBUF);  // write symbol from SBUF to rfifo
		RI = 0;
	}
}

/**----------------------------------------------------------------------------
                            enable_interrupt
-------------------------------------------------------------------------------
Описание:	Разрешает прерывания
-----------------------------------------------------------------------------*/
void enable_interrupt( void )
{
	EA = 1;
	ES = 1;
}

/**----------------------------------------------------------------------------
                            disable_interrupt
-------------------------------------------------------------------------------
Описание:	Запрещает прерывания
-----------------------------------------------------------------------------*/
void disable_interrupt( void )
{
	EA = 0;
	ES = 0;
}
